In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [5]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
ser1=pd.Series([1,2,3,4],['USA','Germany','IND','Russia'])

In [11]:
ser1

USA        1
Germany    2
IND        3
Russia     4
dtype: int64

## DataFrame
-------------------

In [6]:
from numpy.random import randn

In [24]:
np.random.seed(101)

In [25]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
booldf=df>0

In [29]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[(df['W']>0) & (df['Z']>2)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [37]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [40]:
newind='CA NY LA OR WY'.split()

In [41]:
newind

['CA', 'NY', 'LA', 'OR', 'WY']

In [42]:
df['States']=newind

In [43]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     LA
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     WY

In [44]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
LA     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
WY      0.190794  1.978757  2.605967  0.683509

In [1]:
outside=['G1','G1','G1','G2','G2','G2']

In [2]:
inside=[1,2,3,1,2,3]

In [4]:
hier_index=list(zip(outside,inside))

In [5]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [18]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [19]:
df

                    A         B
Groups Nums
G1     1    -0.023427 -0.345706
       2     0.786759  0.494680
       3     0.853568 -0.271651
G2     1     1.155987 -0.227895
       2     0.566051  0.414993
       3    -0.948876 -1.075791

In [21]:
df.index.names=['Groups','Nums']

In [20]:
df

                    A         B
Groups Nums
G1     1    -0.023427 -0.345706
       2     0.786759  0.494680
       3     0.853568 -0.271651
G2     1     1.155987 -0.227895
       2     0.566051  0.414993
       3    -0.948876 -1.075791

In [22]:
df.loc['G1'].loc[2]['B']

0.4946801546049028

In [23]:
df.xs(1,level='Nums')

               A         B
Groups
G1     -0.023427 -0.345706
G2      1.155987 -0.227895

## Missing Values
*************************

In [34]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [35]:
df=pd.DataFrame(d)

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [38]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [39]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [40]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [46]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [47]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

## Groupby
---------------------------------------------------------------

In [49]:
df.groupby('A').describe()

        B                                       C                          \
    count mean std  min  25%  50%  75%  max count mean std  min  25%  50%
A
1.0   1.0  5.0 NaN  5.0  5.0  5.0  5.0  5.0   1.0  1.0 NaN  1.0  1.0  1.0
1.5   0.0  NaN NaN  NaN  NaN  NaN  NaN  NaN   1.0  3.0 NaN  3.0  3.0  3.0
2.0   0.0  NaN NaN  NaN  NaN  NaN  NaN  NaN   1.0  2.0 NaN  2.0  2.0  2.0


     75%  max
A
1.0  1.0  1.0
1.5  3.0  3.0
2.0  2.0  2.0

In [2]:
#For concatenation of dataframes
pd.concat([df1,df2,df3])

In [ ]:
#For merging the dataframes if one or more columns are same
pd.merge(left,right,how='inner',on='key')

In [2]:
#For joining the dataframes based on index
pd.join(right,how='outer')

## Operations on DataFrame

In [4]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [6]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [3]:
def times2(x):
    return x*2

In [5]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [6]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [7]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [8]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [11]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [3]:
data={'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [9]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN